
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.tenant["freifunk-troisdorf-600b63e"].netbox_device.router[0] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].netbox_device.router[0])
  ~ resource "netbox_device" "router" {
        id                       = "682"
      ~ name                     = "ext-freifunk-troisdorf-87e76b3" -> "ext-freifunk-troisdorf-600b63e"
        tags                     = []
        # (24 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].netbox_ip_address.wan[0] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].netbox_ip_address.wan[0])
  ~ resource "netbox_ip_address" "wan" {
      ~ description           = "Tunnel endpoint for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel endpoint for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id                    = "992"
      ~ ip_address            = "77.37.108.81/29" -> "77.37.108.82/29"
        tags                  = []
        # (8 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "677"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "955"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "946"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "681"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ device_interface_id   = 2363 -> (known after apply)
        id                    = "972"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ device_interface_id   = 2363 -> (known after apply)
        id                    = "990"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.data.netbox_device_interfaces.lo)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "682"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.site_v4 will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.site_v4)
  ~ resource "netbox_available_prefix" "site_v4" {
      ~ description      = "Site prefix for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site prefix for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "538"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.site_v6 will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.site_v6)
  ~ resource "netbox_available_prefix" "site_v6" {
      ~ description      = "Site prefix for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site prefix for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "537"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v4["CR3"])
  ~ resource "netbox_available_prefix" "tunnels_v4" {
      ~ description      = "Tunnel from CR3 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR3 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "540"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v4["CR4"])
  ~ resource "netbox_available_prefix" "tunnels_v4" {
      ~ description      = "Tunnel from CR4 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR4 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "541"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v4["CR5"])
  ~ resource "netbox_available_prefix" "tunnels_v4" {
      ~ description      = "Tunnel from CR5 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR5 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "539"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v4["CR6"])
  ~ resource "netbox_available_prefix" "tunnels_v4" {
      ~ description      = "Tunnel from CR6 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR6 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "542"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v6["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v6["CR3"])
  ~ resource "netbox_available_prefix" "tunnels_v6" {
      ~ description      = "Tunnel from CR3 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR3 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "535"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v6["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v6["CR4"])
  ~ resource "netbox_available_prefix" "tunnels_v6" {
      ~ description      = "Tunnel from CR4 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR4 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "533"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v6["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v6["CR5"])
  ~ resource "netbox_available_prefix" "tunnels_v6" {
      ~ description      = "Tunnel from CR5 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR5 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "534"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_available_prefix.tunnels_v6["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_available_prefix.tunnels_v6["CR6"])
  ~ resource "netbox_available_prefix" "tunnels_v6" {
      ~ description      = "Tunnel from CR6 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel from CR6 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id               = "536"
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.core["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.core["CR3"])
  ~ resource "netbox_device_interface" "core" {
      ~ description   = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id            = "2378"
      ~ label         = "Tunnel ext-freifunk-troisdorf-87e76b3" -> "Tunnel ext-freifunk-troisdorf-600b63e"
        name          = "tun2097"
        tags          = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.core["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.core["CR4"])
  ~ resource "netbox_device_interface" "core" {
      ~ description   = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id            = "2379"
      ~ label         = "Tunnel ext-freifunk-troisdorf-87e76b3" -> "Tunnel ext-freifunk-troisdorf-600b63e"
        name          = "tun2097"
        tags          = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.core["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.core["CR6"])
  ~ resource "netbox_device_interface" "core" {
      ~ description   = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id            = "2380"
      ~ label         = "Tunnel ext-freifunk-troisdorf-87e76b3" -> "Tunnel ext-freifunk-troisdorf-600b63e"
        name          = "tun2097"
        tags          = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.tunnels["CR3"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.tunnels["CR3"]
    resource "netbox_device_interface" "tunnels" {
        id            = "2374"
        name          = "tun0"
        tags          = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.tunnels["CR4"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.tunnels["CR4"]
    resource "netbox_device_interface" "tunnels" {
        id            = "2377"
        name          = "tun1"
        tags          = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.tunnels["CR5"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.tunnels["CR5"]
    resource "netbox_device_interface" "tunnels" {
        id            = "2375"
        name          = "tun2"
        tags          = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_interface.tunnels["CR6"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_interface.tunnels["CR6"]
    resource "netbox_device_interface" "tunnels" {
        id            = "2376"
        name          = "tun3"
        tags          = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_primary_ip.v4 has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_primary_ip.v4
    resource "netbox_device_primary_ip" "v4" {
        id                 = "682"
        # (3 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_device_primary_ip.v6 has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_device_primary_ip.v6
    resource "netbox_device_primary_ip" "v6" {
        id                 = "682"
        # (3 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_interface.core["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_interface.core["CR5"])
  ~ resource "netbox_interface" "core" {
      ~ description        = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id                 = "103"
        name               = "tun2097"
        tags               = []
        # (6 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR3"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR3" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR3"
        id                    = "1007"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR4"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR4" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR4"
        id                    = "1008"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR5"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR5" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR5"
        id                    = "1005"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR6"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR6" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR6"
        id                    = "1006"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR3"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v6" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR3" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR3"
        id                    = "994"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR4"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v6" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR4" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR4"
        id                    = "996"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR5"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v6" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR5" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR5"
        id                    = "993"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR6"])
  ~ resource "netbox_ip_address" "local_tunnel_address_v6" {
      ~ description           = "Peer address of ext-freifunk-troisdorf-87e76b3 for CR6" -> "Peer address of ext-freifunk-troisdorf-600b63e for CR6"
        id                    = "995"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.loopback_v4)
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ description           = "Loopback address for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Loopback address for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ device_interface_id   = 2372 -> (known after apply)
        id                    = "1010"
        tags                  = []
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.loopback_v6)
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ description           = "Loopback address for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Loopback address for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ device_interface_id   = 2372 -> (known after apply)
        id                    = "1009"
        tags                  = []
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR3"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
      ~ description           = "Peer address of CR3 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR3 for ext-freifunk-troisdorf-600b63e"
        id                    = "1003"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR4"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
      ~ description           = "Peer address of CR4 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR4 for ext-freifunk-troisdorf-600b63e"
        id                    = "1004"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR5"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
      ~ description           = "Peer address of CR5 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR5 for ext-freifunk-troisdorf-600b63e"
        id                    = "1002"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR6"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
      ~ description           = "Peer address of CR6 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR6 for ext-freifunk-troisdorf-600b63e"
        id                    = "1001"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR3"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v6" {
      ~ description           = "Peer address of CR3 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR3 for ext-freifunk-troisdorf-600b63e"
        id                    = "999"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR4"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v6" {
      ~ description           = "Peer address of CR4 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR4 for ext-freifunk-troisdorf-600b63e"
        id                    = "998"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR5"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v6" {
      ~ description           = "Peer address of CR5 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR5 for ext-freifunk-troisdorf-600b63e"
        id                    = "997"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR6"])
  ~ resource "netbox_ip_address" "remote_tunnel_address_v6" {
      ~ description           = "Peer address of CR6 for ext-freifunk-troisdorf-87e76b3" -> "Peer address of CR6 for ext-freifunk-troisdorf-600b63e"
        id                    = "1000"
        tags                  = []
        # (10 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_prefix.loopback_v6 will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_prefix.loopback_v6)
  ~ resource "netbox_prefix" "loopback_v6" {
      ~ description   = "Loopback prefix for ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Loopback prefix for ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id            = "543"
        tags          = []
        # (13 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel.core["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel.core["CR3"])
  ~ resource "netbox_vpn_tunnel" "core" {
      ~ description     = "Site tunnel from CR3 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site tunnel from CR3 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id              = "59"
      ~ name            = "CR3-ext-freifunk-troisdorf-87e76b3" -> "CR3-ext-freifunk-troisdorf-600b63e"
        tags            = []
        # (6 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel.core["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel.core["CR4"])
  ~ resource "netbox_vpn_tunnel" "core" {
      ~ description     = "Site tunnel from CR4 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site tunnel from CR4 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id              = "60"
      ~ name            = "CR4-ext-freifunk-troisdorf-87e76b3" -> "CR4-ext-freifunk-troisdorf-600b63e"
        tags            = []
        # (6 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel.core["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel.core["CR5"])
  ~ resource "netbox_vpn_tunnel" "core" {
      ~ description     = "Site tunnel from CR5 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site tunnel from CR5 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id              = "57"
      ~ name            = "CR5-ext-freifunk-troisdorf-87e76b3" -> "CR5-ext-freifunk-troisdorf-600b63e"
        tags            = []
        # (6 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel.core["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel.core["CR6"])
  ~ resource "netbox_vpn_tunnel" "core" {
      ~ description     = "Site tunnel from CR6 to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Site tunnel from CR6 to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
        id              = "58"
      ~ name            = "CR6-ext-freifunk-troisdorf-87e76b3" -> "CR6-ext-freifunk-troisdorf-600b63e"
        tags            = []
        # (6 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR3"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR3"]
    resource "netbox_vpn_tunnel_termination" "core_device" {
        id                    = "112"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR4"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR4"]
    resource "netbox_vpn_tunnel_termination" "core_device" {
        id                    = "114"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR6"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR6"]
    resource "netbox_vpn_tunnel_termination" "core_device" {
        id                    = "113"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.core_vm["CR5"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.core_vm["CR5"]
    resource "netbox_vpn_tunnel_termination" "core_vm" {
        id                           = "111"
        tags                         = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.site["CR3"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.site["CR3"]
    resource "netbox_vpn_tunnel_termination" "site" {
        id                    = "116"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.site["CR4"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.site["CR4"]
    resource "netbox_vpn_tunnel_termination" "site" {
        id                    = "115"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.site["CR5"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.site["CR5"]
    resource "netbox_vpn_tunnel_termination" "site" {
        id                    = "117"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netbox_vpn_tunnel_termination.site["CR6"] has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netbox_vpn_tunnel_termination.site["CR6"]
    resource "netbox_vpn_tunnel_termination" "site" {
        id                    = "118"
        tags                  = []
        # (5 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR3"])
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 219 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
      ~ name            = "CR3-ext-freifunk-troisdorf-87e76b3-v4" -> "CR3-ext-freifunk-troisdorf-600b63e-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/219/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR4"])
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 221 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
      ~ name            = "CR4-ext-freifunk-troisdorf-87e76b3-v4" -> "CR4-ext-freifunk-troisdorf-600b63e-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/221/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR5"])
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 222 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
      ~ name            = "CR5-ext-freifunk-troisdorf-87e76b3-v4" -> "CR5-ext-freifunk-troisdorf-600b63e-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/222/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v4["CR6"])
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-87e76b3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 220 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
      ~ name            = "CR6-ext-freifunk-troisdorf-87e76b3-v4" -> "CR6-ext-freifunk-troisdorf-600b63e-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/220/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR3"])
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR3:CR3-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 212 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
      ~ name            = "CR3-ext-freifunk-troisdorf-87e76b3-v6" -> "CR3-ext-freifunk-troisdorf-600b63e-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/212/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR4"])
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR4:CR4-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 214 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:58Z" -> (known after apply)
      ~ name            = "CR4-ext-freifunk-troisdorf-87e76b3-v6" -> "CR4-ext-freifunk-troisdorf-600b63e-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/214/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR5"])
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      + device          = (known after apply)
      ~ display         = "CR5:CR5-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 209 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
      ~ name            = "CR5-ext-freifunk-troisdorf-87e76b3-v6" -> "CR5-ext-freifunk-troisdorf-600b63e-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/209/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.core_v6["CR6"])
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ description     = "Tunnel to ext-freifunk-troisdorf-87e76b3 (Bonner Straße)" -> "Tunnel to ext-freifunk-troisdorf-600b63e (Bonner Straße)"
      ~ display         = "CR6:CR6-ext-freifunk-troisdorf-87e76b3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 213 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
      ~ name            = "CR6-ext-freifunk-troisdorf-87e76b3-v6" -> "CR6-ext-freifunk-troisdorf-600b63e-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/213/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR3"])
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 215 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR3-v4" -> "ext-freifunk-troisdorf-600b63e-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/215/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR4"])
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR4-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 216 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR4-v4" -> "ext-freifunk-troisdorf-600b63e-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/216/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR5"])
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR5-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 217 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR5-v4" -> "ext-freifunk-troisdorf-600b63e-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/217/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v4["CR6"])
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:41Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR6-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 218 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR6-v4" -> "ext-freifunk-troisdorf-600b63e-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/218/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR3"])
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 208 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR3-v6" -> "ext-freifunk-troisdorf-600b63e-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/208/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR4"])
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR4-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 210 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR4-v6" -> "ext-freifunk-troisdorf-600b63e-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/210/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR5"])
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:40Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR5-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 211 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR5-v6" -> "ext-freifunk-troisdorf-600b63e-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/211/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be updated in-place
  # (moved from module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.netboxbgp_session.device_v6["CR6"])
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-19T20:16:39Z" -> (known after apply)
      ~ display         = "ext-freifunk-troisdorf-87e76b3:ext-freifunk-troisdorf-87e76b3-CR6-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 207 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
      ~ name            = "ext-freifunk-troisdorf-87e76b3-CR6-v6" -> "ext-freifunk-troisdorf-600b63e-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/207/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-87e76b3"].module.tunnel.random_integer.core_ifnum has moved to module.tenant["freifunk-troisdorf-600b63e"].module.tunnel.random_integer.core_ifnum
    resource "random_integer" "core_ifnum" {
        id      = "2097"
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 59 to change, 0 to destroy.
```